---
kind: other
id: Properties.T:Autodesk.Revit.DB.BarTypeDiameterOptions
source: html/b523a2fa-7b84-397d-42da-5505914976c5.htm
---
# BarTypeDiameterOptions Properties

Represents the bar model diameter of the RebarBarType.